### Bermain Dengan DataFrame
DataFrame mirip dengan tabel yang ada di MySQL, terdiri dari baris dan kolom. Kolom merepresentasikan variabel, sedangkan baris menunjukkan observasi. Kadangkala, dataframe yang kita gunakan perlu kita lakukan pengolahan lebih lanjut. Terdapat beberapa operasi yang biasa digunakan yaitu

1. Import data
2. Menampilkan sebagian data
3. Mengganti nama kolom
4. Mengambil sebagian kolom
5. Mengambil sebagian baris
6. Missing Values
7. Menggabungkan dua dataframe atau lebih

### Refferences
1. https://www.kdnuggets.com/2019/06/select-rows-columns-pandas.html
2. https://www.bps.go.id/statictable/2019/02/27/2034/ekspor-logam-dasar-mulia-menurut-negara-tujuan-utama-2012-2017.html

### 1. Import Data

In [4]:
import pandas as pd

In [3]:
### Import data dari CSV
df = pd.read_csv('Data/Ekspor Logam Dasar Mulia.csv',sep=';')

In [102]:
### Import data dari xlsx
df = pd.read_excel('Data/Ekspor Logam Dasar Mulia.xls',sheet_name='Sheet2')

### 2. Menampilkan sebagian data

In [103]:
df.head()

       Negara    2012    2013    2014    2015    2016    2017
0   Singapura    35.0    96.9   115.3   143.9   140.0   160.3
1      Jepang  1189.1  1408.1  1486.4  1320.3  1448.4  1195.6
2   Hongkong     10.0    16.9    28.0    16.5    22.2    38.6
3     Inggris     0.0     0.0     0.0     0.1    20.8     7.7
4  Australia     46.3    30.4     8.3     2.4     5.3     4.4

### 3. Mengganti nama kolom

In [104]:
df.columns

Index(['Negara', 2012, 2013, 2014, 2015, 2016, 2017], dtype='object')

In [105]:
df.columns = ['Negara_Tujuan','t_2012','t_2013','t_2014','t_2015','t_2016','t_2017']

In [106]:
df.head()

  Negara_Tujuan  t_2012  t_2013  t_2014  t_2015  t_2016  t_2017
0     Singapura    35.0    96.9   115.3   143.9   140.0   160.3
1        Jepang  1189.1  1408.1  1486.4  1320.3  1448.4  1195.6
2     Hongkong     10.0    16.9    28.0    16.5    22.2    38.6
3       Inggris     0.0     0.0     0.0     0.1    20.8     7.7
4    Australia     46.3    30.4     8.3     2.4     5.3     4.4

### 4. Mengambil sebagian kolom

In [18]:
### Mengambil satu kolom
df['Negara_Tujuan']

0           Singapura
1              Jepang
2           Hongkong
3             Inggris
4          Australia
5               Swiss
6            Thailand
7            Tiongkok
8       Korea Selatan
9     Amerika Serikat
10            Lainnya
Name: Negara_Tujuan, dtype: object

In [42]:
### Mengambil satu kolom
df.Negara_Tujuan

0           Singapura
1              Jepang
2           Hongkong
3             Inggris
4          Australia
5               Swiss
6            Thailand
7            Tiongkok
8       Korea Selatan
9     Amerika Serikat
10            Lainnya
Name: Negara_Tujuan, dtype: object

In [41]:
### Mengambil beberapa kolom
df[['Negara_Tujuan','t_2012']]

      Negara_Tujuan  t_2012
0         Singapura    35.0
1            Jepang  1189.1
2         Hongkong     10.0
3           Inggris     0.0
4        Australia     46.3
5             Swiss     0.0
6          Thailand    14.1
7          Tiongkok     0.0
8     Korea Selatan     0.0
9   Amerika Serikat     4.5
10          Lainnya    14.9

### Mengambil beberapa baris

In [107]:
### Mengambil baris ke 2
df.loc[1]

Negara_Tujuan    Jepang
t_2012           1189.1
t_2013           1408.1
t_2014           1486.4
t_2015           1320.3
t_2016           1448.4
t_2017           1195.6
Name: 1, dtype: object

In [44]:
### Mengambil beberapa baris
### iloc bekerja pada index
df.iloc[1:4]

  Negara_Tujuan  t_2012  t_2013  t_2014  t_2015  t_2016  t_2017
1        Jepang  1189.1  1408.1  1486.4  1320.3  1448.4  1195.6
2     Hongkong     10.0    16.9    28.0    16.5    22.2    38.6
3       Inggris     0.0     0.0     0.0     0.1    20.8     7.7

In [117]:
### Mengganti nilai suatu observasi
df.loc[1,'t_2012'] = 1123

In [118]:
df.loc[1,'t_2012']

1123.0

### Missing Values

In [82]:
### Cek total missing value tiap kolom
df.isnull().sum()

Negara_Tujuan    0
t_2012           0
t_2013           0
t_2014           0
t_2015           0
t_2016           0
t_2017           0
dtype: int64

In [58]:
### Mengganti nilai null menjadi 0
df.fillna(0,inplace=True)

### Menggabungkan dua kolom atau lebih (Just merge)

In [93]:
df1 = df[['Negara_Tujuan','t_2012']]
df2 = df[['t_2013']]

In [100]:
pd.concat([df1,df2],axis=1,ignore_index=True)

                  0       1       2
0         Singapura    35.0    96.9
1            Jepang  1189.1  1408.1
2         Hongkong     10.0    16.9
3           Inggris     0.0     0.0
4        Australia     46.3    30.4
5             Swiss     0.0     0.0
6          Thailand    14.1     4.7
7          Tiongkok     0.0     0.0
8     Korea Selatan     0.0     3.7
9   Amerika Serikat     4.5     5.6
10          Lainnya    14.9    19.8